import React from "react";

const PR: React.FC = () => (
  <section id="pr" className="pr-section" data-aos="fade-up">
    <div>
      <h2>自己PR</h2>
      <p>
        要件通りに作るだけでなく、「もっと誰でも簡単に使いやすく」を特に意識して開発を進めています。
        <br />
        クライアントの要望をちゃんと理解できているか、機能を損なわずよりシンプルな仕様にすることはできるか。
        仕様書や設計段階の課題にも気付き、正しい解決アプローチを提案するのが得意です。
      </p>
      <p>
        現場ではディレクター・デザイナーと連携し、チーム全体で成果を出すことを意識しています。
        <br />
        また、新入社員の研修や勉強会の実施も担当しており、ディレクター・営業・デザイナーもwebサイト制作の基礎は理解した状態で業務に臨めるようにしてもらう取り組みを進めています。
        デザイナーからエンジニアに転向し実務未経験からキャリアを積んできた自分だからこそ、さまざまなメンバーの疑問や相談に対応できているのではないかと考えております。
        <br />
        今後はバックエンド領域をさらに強化し、WordPressを超えたサービス設計にも関わっていきたいと考えています。
        <br />
        最終的にはフルスタックで開発のできるエンジニアになるため、日々勉強しながら業務にあたっています。
      </p>
    </div>
  </section>
);

export default PR;
